test/requests/payee_payment_method_error_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Body>
    <PayeePaymentMethod xmlns="http://Tipalti.org/">
      <payerName>MyPayer</payerName>
      <timestamp>1521234048</timestamp>
      <key>23288af261d6f2aa13c01da4a221694ddbf4f240f28c7f46853ca2cca4e63247</key>
      <idap>badpayee</idap>
    </PayeePaymentMethod>
  </soap12:Body>
</soap12:Envelope>
